{
  "architectures": [
    "RnaBertModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "emb_layer_norm_before": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 120,
  "initializer_range": 0.02,
  "intermediate_size": 40,
  "layer_norm_eps": 1e-12,
  "mask_token_id": null,
  "max_position_embeddings": 440,
  "model_type": "rnabert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "position_embedding_type": "absolute",
  "ss_size": 8,
  "token_dropout": false,
  "torch_dtype": "float32",
  "transformers_version": "4.39.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_list": [
    "<pad>",
    "<mask>",
    "A",
    "U",
    "G",
    "C"
  ],
  "vocab_size": 6
}
