Repository: pypi-data/pypi-mirror-264
Catalog: packages/pretix-dbvat/pretix_dbvat-1.1.0-py3-none-any.whl/pretix_dbvat/locale/*_Informal/LC_MESSAGES/django.po
Languages: de

source: DB Event Discount
de: DB Veranstaltungsrabatt

source: Distribute Deutsche Bahn Veranstaltungsrabatt (DB VAT) eCoupons to your attendees
de: Verteile DB Veranstaltungsrabatt (DB VAT) eCoupons an Teilnehmende

source: eCoupon source
de: eCoupon Quelle

source: List
de: Liste

source: Discount amount
de: Rabattwert

source: Issue eCoupons
de: eCoupon vergeben

source: when order is placed
de: wenn die Bestellung getätigt wird

source: when order is marked as paid
de: wenn die Bestellung als bezahlt markiert wird

source: It is recommended to only issue eCoupons to orders once they are paid to limit the potential for misuse (placing orders to harvest eCoupons without the intent to ever pay to the tickets).
de: In der Regel sollten eCoupons nur an Bestellungen ausgegeben werden, wenn diese bezahlt wurden. Dies hält das Missbrauchspotential (Tätigen von Bestellungen ohne diese jemals bezahlen zu wollen, nur um eCoupons einzusammeln) gering.

# subevent
source: Date
de: Termin

source: Add one coupon code per line.
de: Füge einen Coupon Code pro Zeile ein.

source: Coupon code {code} already exists.
de: Der Coupon Code {code} existiert bereits.

# dbvat
source: Issue DB VAT eCoupons if this product is purchased
de: DB VAT eCoupons ausgeben, wenn dieses Produkt gekauft wird

source: Valid from
de: Gültig ab

source: Valid until
de: Gültig bis

source: An entry with this code already exists.
de: Ein Eintrag mit diesem Code existiert bereits.

source: Issue DB VAT eCoupons if this product is purchased
de: DB VAT eCoupons ausgeben, wenn dieses Produkt gekauft wird

source: DB VAT eCoupon deleted.
de: DB VAT eCoupon gelöscht.

source: DB VAT eCoupon created.
de: DB VAT eCoupon erstellt.

source: DB VAT eCoupon changed.
de: DB VAT eCoupon geändert.

source: Failed to assign an DB VAT eCoupon.
de: DB VAT eCoupon konnte nicht zugewiesen werden.

source: Import new DB VAT eCoupons
de: Neue DB VAT eCoupons importieren

source: Please make sure to insert the dates that the vouchers are valid for travel - not the dates for when they can be used to book travel. The former will be provided to you by DB and should only cover a few days around your event date. The latter, to be ignored dates, span a much larger period and probably cover the time period from now until the scheduled end of your event.
de: Bitte stell sicher, dass als Gültigkeitsdatum der Reisezeitraum eingegeben ist - und nicht der Buchungszeitraum. Der Reisezeitraum für die eCoupons wird von der DB mitgeteilt und deckt in der Regel das Zeitfenster um die Veranstaltung plus/minus einige Tage ab. Der (hier irrelevante) Buchungszeitraum hingegen sollte sehr viel länger sein und sich vom jetzigen Zeitpunkt bis hin zum geplanten Ende der Veranstaltung erstrecken.

source: Save
de: Speichern

source: Delete DB VAT eCoupon
de: Lösche DB VAT eCoupon

source: Are you sure you want to delete the eCoupon code <strong>%(secret)s</strong>?
de: Sicher, dass der eCoupon <strong>%(secret)s</strong> gelöscht werden soll?

source: Cancel
de: Abbrechen

source: Delete
de: Löschen

source: This eCoupon already has been used. It is not recommended to modify it.
de: Dieser eCoupon wurde bereits verwendet. Er sollte nicht mehr verändert werden.

source: History
de: Verlauf

source: Not a single product is set up to issue DB Event Discount eCoupons. In order for this plugin to work, you will need to activate the "Issue DB VAT eCoupons if this product is purchased" checkbox on the "Additional settings" tab of at least on product.
de: Kein einziges Produkt wurde für die Verteilung von DB Eventrabatt eCoupons konfiguriert. Damit diese Erweiterung ordnungsgemäß funktioniert, muss die Option "DB VAT eCoupons ausgeben, wenn dieses Produkt gekauft wird" in den "Zusätzlichen Einstellungen" von mindestens einem Produkt aktiviert werden.

source: You haven't imported any eCoupon codes yet.
de: Es wurden bisher noch keine eCoupons importiert.

source: Import new eCoupons
de: Neue eCoupons importieren

source: <strong>%(count)s</strong> eCoupon codes are currently available to be used.
de: <strong>%(count)s</strong> eCoupons können aktuell verteilt werden.

source: Used by ticket
de: Genutzt von Ticket

source: Use as a template for a new import
de: Als Vorlage für einen neuen Import nutzen

source: Settings
de: Einstellungen

source: The DB Event Discount is a pilot program, available to select events. Please contact the DB Event Team learn more about participation eligibility and alternatives such as the DB Event Ticket.
de: Der DB Veranstaltungsrabatt ist ein Pilotprogramm, welches nur für ausgewählte Veranstaltungen zur Verfügung steht. Bitte kontaktiere das DB Veranstaltungs-Team um mehr Details über die Möglichkeit einer Teilnahme und Alternativen, wie bspw. dem DB Veranstaltungsticket, zu erfahren.

source: By cooperating with Deutsche Bahn (DB), you can make your events more sustainable and offer your attendees at the same time a significant discount on their long distance train travel.
de: Durch eine Kooperation mit der Deutschen Bahn (DB) können Veranstaltungen noch nachhaltiger gemacht werden und Teilnehmende gleichzeitig einen signifikanten Rabatt auf Zugtickets des Fernverkehrs erhalten.

source: Every attendee is assigned two eCoupons - free of charge - which they can then redeem either on bahn.de or within the mobile DB navigator apps. Each of the coupons grants the user a predetermined discount on all long distance tickets - no matter if SuperSpar-, Spar- or Flexpreis-tickets.
de: Teilnehmenden werden - kostenfrei - zwei eCoupons zugewiesen, welche sie entweder auf bahn.de oder innerhalb der mobilen DB Navigator Apps einlösen können. Jeder der beiden eCoupons gewährt hierbei einen festen, vorab vereinbarten Rabatt auf alle Tickets des Fernverkehrs - egal ob SuperSpar-, Spar- oder Flexpreis.

source: To get started, please visit <a href="%(dbvatdiscount)s" target="_blank">%(dbvatdiscount)s</a> for more information and <a href="%(dbvatcontact)s" target="_blank">contact the DB Event Team</a> to request your participation. Please make sure to explicitly mention the Event Discount ("Veranstaltungsrabatt") and pretix in your message.
de: Um am DB Veranstaltungsrabatt teilzunehmen, besuche bitte <a href="%(dbvatdiscount)s" target="_blank">%(dbvatdiscount)s</a> und <a href="%(dbvatcontact)s" target="_blank">kontaktiere das DB Veranstaltungs-Team</a>. Bitte erwähne dabei explizit den Veranstaltungsrabatt und pretix in der Nachricht.

source: Please remember, that you'll need to mark products that are eligible to receive eCoupons explicitly by activating the corresponding checkbox within the product's "Additional Settings"-tab.
de: Bitte bedenke, dass Produkte explizit freigeschaltet werden müssen, um eCoupons zu erhalten. Dies geschieht durch das Aktivieren der entsprechenden Option im "Zusätzliche Einstellungen"-Tab des jeweiligen Produktes.

source: For a sustainable journey to our event, we're happy to provide you with an exclusive %(discount_percentage)s%% event discount for long-distance travel on Deutsche Bahn.
de: Für eine nachhaltige Anreise zu unserer Veranstaltung erhältst Du von uns einen exklusiven Veranstaltungsrabatt von %(discount_percentage)s%% für den Fernverkehr der Deutschen Bahn.

source: Your personalized DB promotional vouchers for your outward and return journey are:
de: Deine personalisierten DB-Aktionsgutscheine für Hin- und Rückfahrt sind:

source: Valid for travel from %(valid_from)s until %(valid_to)s
de: Gültig im Reisezeitraum vom %(valid_from)s bis zum %(valid_to)s

source: These eCoupons can be redeemed on when booking Flex-, SuperSpar- and Sparpreis tickets using <a href="%(bahn)s" target="_blank">www.bahn.de</a> or the <a href="%(navigator)s" target="_blank">DB Navigator apps</a> using your personal account. Please make sure to book your outward and return journey separately, since each eCoupon is only applied to the single most expensive ticket in your booking.
de: Diese eCoupons können bei der Buchung von Flex-, SuperSpar- und Sparpreis-Tickets auf <a href="%(bahn)s" target="_blank">www.bahn.de</a> oder in den <a href="%(navigator)s" target="_blank">DB Navigator Apps</a> mit einem Privat-Account eingelöst werden. Bitte buche Hin- und Rückfahrt in zwei separaten Buchungen, da jeder eCoupon nur einen Rabatt auf die eine, teuerste Fahrkarte im Warenkorb gewährt.

source: Terms and conditions apply, more information on <a href="%(terms)s" target="_blank">%(terms)s</a>.
de: Einlösebedingungen und weitere Informationen finden sich unter <a href="%(terms)s" target="_blank">%(terms)s</a>.

source: The requested ticket code does not exist.
de: Der angefragte Ticket Code existiert nicht.

source: A coupon code can not be deleted if it already has been used.
de: Ein Coupon Code kann nicht gelöscht werden, wenn er bereits verwendet wurde.

source: The selected ticket code has been deleted.
de: Der ausgewählte Ticket Code wurde gelöscht.

source: Your changes have been saved.
de: Die Änderungen wurden gespeichert.

source: The new coupon have been created.
de: Der neue Coupon wurde erstellt.
